<template>
    <div>

        <header-component></header-component>


        <section class="featured-section" style="    background: whitesmoke;">

            <div class="container">
                <transition name="showDiv2">
                    <div class="infomation_about" v-if="showDiv2">
                        <div class="row">
                            <div class="col-md-12">
                                <div class="titie-section wow fadeInDown animated ">
                                    <h1>Налоговый вычет за онлайн-кассу<br>
                                        11 Января 2019</h1>

                                </div>
                            </div>
                        </div>
                        <div class="row">
                            <div class="col-md-12 page-info" style="margin-top: 50px">
                                <p>С 1 января 2018 года некоторые предприниматели имеют право на <strong>налоговый вычет
                                    за
                                    онлайн-кассу</strong>: вступил в силу закон от 27.11.2017 № 349-ФЗ «О внесении
                                    изменений в
                                    часть вторую Налогового кодекса Российской Федерации».</p><br>
                                <p>Вычесть расходы на онлайн-ККТ из суммы налога разрешено индивидуальным
                                    предпринимателям, которые применяют патентную систему налогообложения или платят
                                    единый налог на вмененный доход.</p><br>
                                <p>Вернуть таким образом получится до 18 000 рублей на каждую кассу. В эту сумму может
                                    входить не только стоимость самой ККТ: можно учесть расходы на покупку фискального
                                    накопителя, необходимых программ, услуг по настройке и прочие затраты на приведение
                                    техники в рабочий режим.</p><br>
                                <h1 class="text-center">Налоговый вычет на покупку ККТ: обязательные требования</h1>
                                <br>
                                <p>Льгота распространяется не на все кассы: есть условия, которые обязательно нужно
                                    соблюдать</p><br>
                                <ul>
                                    <li>Во-первых, налоговый вычет предоставляется только на ККТ, включенные в
                                        официальный реестр ФНС.
                                    </li>
                                    <li>Во-вторых, кассу обязательно нужно поставить на учет, иначе вернуть потраченные
                                        на нее деньги не получится.<br>
                                        Возместят ли вам расходы — зависит от вашей деятельности и даты постановки ККТ
                                        на учет:
                                    </li>
                                    <br>
                                    <li>
                                        ИП на ПСН или ЕНВД в сфере розничной торговли или общественного питания,
                                        имеющие сотрудников на трудовых договорах, могут получить вычет, если
                                        зарегистрировали кассу с 1 февраля 2017 до 1 июля 2018 года. Таким образом, они
                                        могут получить налоговый вычет при покупке онлайн-ККТ только в 2018.
                                    </li>
                                    <li>
                                        Остальные ИП на ЕНВД и ПСН могут получить вычет, если зарегистрировали кассу с
                                        1 февраля 2017 до 1 июля 2019 года.<br>
                                        Таким образом, в 2019 вы сможете претендовать на возмещение расходов, только
                                        если у вас нет наемных сотрудников. Если по трудовому договору в вашем кафе
                                        занят хотя бы один человек, вернуть расходы на кассу уже не получится
                                    </li>
                                </ul>
                                <br>
                                <h2 class="text-center">Вычет по ЕНВД при покупке онлайн-кассы</h2><br>
                                <p>При покупке онлайн-кассы на ЕНВД налоговый вычет нельзя получить за период,
                                    который предшествовал регистрации ККТ. Сумма налога уменьшается при исчислении
                                    за налоговые периоды 2018 и 2019 годов, но не раньше периода, в котором был
                                    зарегистрирован аппарат. Если сумма ЕНВД меньше вычета за онлайн-кассу, то можно
                                    перенести остаток на следующие периоды до конца 2019 года.</p><br>
                                <h2 class="text-center">
                                    Налоговый вычет на ККТ для ПСН
                                </h2><br>
                                <p>Для ИП на ПСН сумма налога уменьшается за периоды, которые начинаются в 2018 году
                                    и завершаются после регистрации ККТ. Если затраты превышают лимит, остаток
                                    учитывается при начислении налогов за следующие периоды. А если сумма налога
                                    оказалась меньше затрат, можно уменьшить патент с других видов деятельности,
                                    если для них используется касса.</p>
                                <h1 class="text-center">Как получить налоговый вычет при покупке онлайн-кассы</h1>
                                <br>
                                <p>Чтобы оформить вычет, индивидуальные предприниматели на ЕНВД должны подать
                                    налоговую декларацию и отразить в ней расходы на ККТ.</p><br>
                                <p>Предпринимателям на ПСН нужно предоставить в налоговую уведомление об уменьшении
                                    суммы платежа по патенту. Пока официальный шаблон этого документа не утвержден,
                                    и заполнять его можно в свободной форме.</p><br>
                                <br>
                                <p>В уведомлении обязательно указать:</p>
                                <ol>
                                    <li>ФИО и ИНН налогоплательщика.</li>
                                    <li>Номер и дату патента, в отношении которого производится уменьшение суммы
                                        налога, сроки уплаты уменьшаемых платежей, суммы уменьшения.
                                    </li>
                                    <li>Модель и заводской номер купленной кассы.</li>
                                    <li>Сумму расходов на покупку.</li>
                                </ol>
                                <br>
                                <p>Если вы уже заплатили сумму, из которой хотите получить вычет, то необходимо
                                    подать в налоговую заявление о возврате излишне уплаченного налога.</p>
                                <br>
                                <p>К декларации или уведомлению необходимо приложить документ, подтверждающий затраты на
                                    покупку ККТ, фискального накопителя, программного обеспечения, выполнение работ по
                                    их настройке и оказание соответствующих услуг, в том числе — на модернизацию старой
                                    кассы.</p>
                                <p>Документы подаются в тот налоговый орган, где предприниматель состоит на учете как
                                    налогоплательщик и куда он уплатил или собирается уплатить налог, из которого хочет
                                    получить вычет.
                                </p>
                                <br>
                                <h1 class="text-center">Налоговый вычет на ККТ: часто задаваемые вопросы</h1>
                                <br>
                                <h2 class="text-center">Возможен ли налоговый вычет за онлайн-кассу для ИП на УСН?</h2>
                                <br>
                                <p>Только в случае, когда ИП совмещает УСН и ЕНВД / ПСН. Тогда можно зачесть расходы на
                                    те кассы, которые используются на вмененке или патенте. Компаниям и предпринимателям
                                    на упрощенке кассовый вычет не предоставляют.</p>
                                <br>
                                <h2 class="text-center">Можно ли получить вычет за онлайн-кассу, купленную в 2017
                                    году?</h2>
                                <br>
                                <p>Да, но только если вы поставили ее на учет в ФНС после 1 февраля. Если вы
                                    регистрировали онлайн-кассу в январе 2017 года, вернуть расходы на ее покупку
                                    нельзя.</p>
                                <br>
                                <h2 class="text-center">Как получить налоговый вычет за онлайн-кассы в полном
                                    размере?</h2>
                                <br>
                                <p>Полный размер вычета, установленный законом, — 18 000 рублей на каждую кассу. Вернуть
                                    деньги сверх этой суммы не получится, даже если ККТ обошлась дороже.</p>
                                <br>
                                <h2 class="text-center">Как получить налоговый вычет за онлайн-кассу ИП на ПСН?</h2>
                                <br>
                                <p>Если вы применяете патентную систему налогообложения (патент), вычет за онлайн-кассу
                                    оформляется с помощью уведомления об уменьшении суммы налога.<br><br>
                                    Если налог уже заплачен — подайте в ФНС заявление на возврат излишне уплаченной
                                    суммы.<br><br>
                                    Документы предоставьте в налоговую инспекцию, где состоите на учете и куда будете
                                    платить налог. Можно отправить их в ФНС и по интернету, заверив усиленной
                                    квалифицированной электронной подписью.
                                </p>
                                <br>
                            </div>
                        </div>
                    </div>
                </transition>
            </div>

        </section>


        <section class="best-seller-section">
            <recommended-component></recommended-component>
        </section>

        <section class="contact-section">
            <footer-component></footer-component>
        </section>


    </div>
</template>

<script>
    export default {
        data: function () {
            return {
                categories: {},
                products: {},
                showProductsUpdate: false,
                styleSpanCountProducts: {},
                count_all: true,
                cart: {},
                cartMessage: {},
                showCartMessage: false,
                productsRec: {},
                showDiv2: false
            }
        },
        mounted() {
            this.getCategories();
            this.getProducts();
            this.getCartInfo();
            this.getProductsRec();
            setTimeout( () => {
                this.showProductsUpdate = true;
                this.showDiv2 = true
            }, 900 );


        },
        methods: {
            getCategories: function () {
                axios( {
                    method: 'get',
                    url: '/get_categories',
                } ).then( ( response ) => {
                    this.categories = response.data;

                } );
            },
            showCategory: function ( $categoryId ) {
                this.showProductsUpdate = false;
                this.count_all = false;
                this.styleSpanCountProducts = {
                    top: '-23px',
                    right: '-6px'
                };
                axios( {
                    method: 'get',
                    url: '/products/' + $categoryId,
                } ).then( ( response ) => {
                    this.products = response.data.products;
                    this.categories = response.data.categories;

                } );
                setTimeout( () => {
                    this.showProductsUpdate = true;
                }, 500 )

            },
            getProducts: function () {
                this.count_all = true;
                axios( {
                    method: 'get',
                    url: '/get_products',
                } ).then( ( response ) => {
                    this.products = response.data;

                } );
            },

            showAllCategories: function () {
                this.showProductsUpdate = false;
                this.count_all = true;
                axios( {
                    method: 'get',
                    url: '/get_products',
                } ).then( ( response ) => {
                    this.products = response.data;
                    var app = this;
                    for ( var i = 0; i < response.data.length; i++ ) {
                        app.categories.categories[ i ].show = false;

                    }
                } );
                setTimeout( () => {
                    this.showProductsUpdate = true;
                }, 500 )
            },
            addCart: function ( id ) {
                this.addCartAnimation();
                axios( {
                    method: 'get',
                    url: '/cart_add/' + id,
                } ).then( ( response ) => {
                    this.cart = response.data;
                    this.addCartAnimation( response.data.message );
                } );

            },
            addCartAnimation: function ( message ) {
                this.showCartMessage = false;
                this.cartMessage = message;
                setTimeout( () => {
                    this.showCartMessage = true;
                }, 300 );
                setTimeout( () => {
                    this.showCartMessage = false;
                }, 3000 )
            },
            getCartInfo: function () {
                axios( {
                    method: 'get',
                    url: '/cart_info',
                } ).then( ( response ) => {
                    this.cart = response.data;
                } );
            },
            getProductsRec: function () {
                axios( {
                    method: 'get',
                    url: '/get_recomended',
                } ).then( ( response ) => {
                    this.productsRec = response.data;
                    console.log
                } );
            }

        }

    }
</script>
