<template>
    <div>

        <header-component></header-component>

        <section class="search-section">
            <div class="container">
                <div class="row subscribe-from">
                    <div class="col-md-12">
                        <form class="form-inline col-md-12 wow fadeInDown animated">
                            <div class="form-group">
                                <input type="email" class="form-control subscribe" id="email" placeholder="Search...">
                                <button class="suscribe-btn" ><i class="pe-7s-search"></i></button>
                            </div>
                        </form><!-- end /. form -->
                    </div>
                </div><!-- end of/. row -->
            </div><!-- end of /.container -->
        </section><!-- end of /.news letter section -->


        <section class="featured-section" style="    background: whitesmoke;">

            <div class="container">
                <transition name="showDiv2" >
                <div class="infomation_about" v-if="showDiv2">
                <div class="row">
                    <div class="col-md-12" >
                        <div class="titie-section wow fadeInDown animated ">
                            <h1>ФЗ-54</h1>
                        </div>
                    </div>
                </div>
                <div class="row">
                    <div class="col-md-12">
                      <h1 class="h1-fz text-center">Закон 54-ФЗ «О применении контрольно-кассовой техники». Что меняется в 2018 году?</h1>

                    </div>
                </div>
                    <div class="row">
                        <div class="col-md-12">
                            <div id="bx_689919819_2430">
                                <p>
                                    С прошлого года в России действуют поправки в закон <strong>54-ФЗ «О применении контрольно-кассовой техники»</strong>. Завершился второй этап кассовой реформы, третий пройдет в 2019 году. Кто и когда должен поставить онлайн-кассу? Как зарегистрировать и где обслуживать контрольно-кассовую технику (ККТ)? Какие данные указывать в чеке и как избежать штрафов?
                                </p>

                                <p>
                                    Переход на работу по новому порядку — это не просто покупка новой кассовой техники. Чтобы зарегистрировать кассу в налоговой, придется подключиться к ОФД. Теперь в чеках обязательны наименования товаров, поэтому вам нужна кассовая программа. У нас вы можете приобрести полное решение. В него входит ККТ с ФН, ОФД на год и кассовая программа.
                                </p>
                                <h2>54-ФЗ. Новый порядок применения ККТ с 2018 года</h2>
                                <ul>
                                    <li>Основная поправка в закон 54-ФЗ «О применении контрольно-кассовой техники» 2017 года меняет схему работы торговых организаций с налоговой. Перемены касаются большинства предпринимателей. Новый порядок применения ККТ предполагает, что данные о продажах с каждого выбитого чека должны передаваться в налоговую через интернет. Отправляются они через оператора фискальных данных (ОФД). С одной из компаний-ОФД нужно обязательно заключить договор. <a href="sofd" target="_blank">Список операторов фискальных данных — здесь &gt;&gt;</a> </li>
                                    <li>Предприниматели теперь могут использовать только кассы с фискальным накопителем (ФН). ФН нужен для записи и хранения информации о расчетах, которые проводятся на ККТ. Все разрешенные для использования кассы внесены в реестр ФНС. Налоговая сертифицировала уже больше 100 моделей ККТ нового образца от разных производителей. Ведется и реестр фискальных накопителей — там их уже более 15. Подробнее: <a href="kassovye-apparaty-s-2019-goda" target="_blank">кассовые аппараты в 2019 году &gt;&gt;</a> </li>
                                    <li> <a href="/kak-zaregistrirovat-onlayn-kassu-v-nalogovoy" target="_blank">Зарегистрировать онлайн-кассу в налоговой </a> можно через интернет, но только после подписания договора с ОФД. А вот в ЦТО можно уже не обращаться. Обязательное заключение договора с центром техобслуживания больше не требуется для использования ККТ. Предприниматель сам решает — выбрать ЦТО или другой сервисный центр или делать все самостоятельно. </li>
                                    <li> С 1 января 2019 онлайн-касса должна поддерживать формат фискальных данных 1.05 и ставку НДС 20%. Без обновлений работать будет нельзя. Подробнее о <a target="_blank" href="/perekhod-na-ffd-1-05-i-nds-20-atol-shtrikh-m-viki-print">переходе на ФФД 1.05 и НДС 20% &gt;&gt;</a></li>


                                    <li>Хотя передача данных в налоговую стала онлайн-процедурой, закон 54-ФЗ «О применении ККТ» не содержит положений о том, что выдавать бумажный чек в 2019 году не надо. По желанию покупателя нужно отправить ему документ по email или SMS в дополнение к распечатанному на ККТ. Электронный чек приравнивается к бумажному.</li>
                                    <li>Закон о ККТ с 2018 года требует указывать больше данных в чеках и бланках строгой отчетности. Например, перечень пробитых товаров (с указанием цены, скидок), заводской номер фискального накопителя и номер телефона или email покупателя, если документ передается в электронной форме. <a href="/novye-objazatelnye-rekvizity-chekov-kkt-i-bso" target="_blank">Новые обязательные реквизиты чеков ККТ и БСО в 2019 году &gt;&gt;</a> </li>
                                    <li>Предпринимателей на патенте и ЕНВД тоже коснулись изменения в 54-ФЗ: с 2018 года они тоже начинают ставить кассы, хотя раньше были вообще освобождены от использования ККТ. Те, кто работает в рознице и общепите, должны были перейти на новый порядок с 1 июля этого года. А для остальных применение ККТ обязательно с 1 июля 2019 года. Читайте все об <a href="/onlayn-kassy-dlya-ip-na-envd-i-psn-otsrochka-do-2021-goda" target="_blank">отсрочках по онлайн-кассам &gt;&gt;</a> </li>
                                    <li>Расходы на покупку ККТ можно вычесть из налога — до 18 000 рублей на каждый аппарат. Но не всем. <a href="/nalogovyj-vychet-za-onlajn-kassu" target="_blank">Налоговый вычет за онлайн-кассу: подробнее &gt;&gt;</a> </li>
                                    <li>Закон о ККТ с 2018 года коснулся не всех. Некоторые организации освобождены от применения касс. Узнайте, <a href="/komu-nuzhno-stavit-kassovyj-apparat" target="_blank">кому можно не ставить онлайн-кассу &gt;&gt;</a></li>
                                    <li>Снять ККТ с учета можно также без посещения налоговой — через личный кабинет на сайте ФНС. Но налоговая может сделать это и принудительно. <a href="/kak-snyat-s-ucheta-online-kassu" target="_blank">Как снять онлайн-кассу с учета — здесь &gt;&gt;</a></li>
                                </ul>

                                <p>
                                </p>
                                <p>
                                </p>

                                <h2>Применение ККМ в 2018-2019 году — как это выглядит на практике</h2>
                                <p>
                                    Порядок применения ККТ в 2018 году изменился. Предприниматель может поставить онлайн-кассу на учет через интернет. Подробно о том, <a href="/kak-zaregistrirovat-onlayn-kassu-v-nalogovoy" target="_blank">как зарегистрировать онлайн-кассу &gt;&gt;</a>
                                </p>
                                <p>
                                    Когда кассовый аппарат зарегистрирован, с ним начинает работать продавец. Применение ККТ в 2018-2019 году в целом не отличается от привычной работы. Покупатель оплачивает товар и получает чек — теперь и электронный. Фискальный регистратор отправляет сведения о продаже или возврате оператору фискальных данных. ОФД обрабатывает информацию, посылает подтверждение обратно в кассу, а данные — в налоговую. Все сведения передаются параллельно с оформлением чека, то есть время обслуживания покупателя не меняется.
                                </p>
                                <img src="/images/FZ-54-shema.png" alt="" align="bottom">
                                <div>
                                    <img src="/upload/iblock/307/FZ-54-shema.png" alt="" align="bottom">
                                </div>
                                <p>
                                    Закон 54-ФЗ «О применении контрольно-кассовой техники» предполагает, что с 2018 года во все торговые точки должен быть проведен интернет. Если подключения к сети нет, то работать вы не сможете. При этом сбой связи торговле не помешает — ФН сохранит информацию о каждой покупке и передаст ее в налоговую, когда появится интернет. Устройство хранит информацию в течение 30 дней. Если за это время соединения с интернетом не будет, ФН заблокируется, и регистрировать продажи станет невозможно. Подробнее: <a href="/kassovye-apparaty-s-2019-goda" target="_blank">кассовые аппараты в 2019 году &gt;&gt;</a>
                                </p>
                                <p>
                                    Новые правила применения ККМ в 2018 году помогали государству сделать торговлю прозрачной. Но для предпринимателей переоснащение места кассира — дополнительные затраты. Минфин подсчитал, что в 2018 году ККТ обошлась в среднем в 25 000 рублей.
                                </p>
                                <p>
                                    При этом ИП на патенте и ЕНВД могут вернуть за каждую ККМ до 18 000 рублей: с 2018 года в законе о ККТ есть такая поправка. Для этого нужно обратиться в ФНС за налоговым вычетом. Причем получить его можно не только за покупку кассы, но и за услуги по ее настройке и подключению к ОФД. <a href="/nalogovyj-vychet-za-onlajn-kassu" target="_blank"> Налоговый вычет на покупку ККТ: обязательные требования &gt;&gt;</a>
                                </p>
                                <a name="shtraf"></a>
                                <h3>Чем грозит неправильное применение контрольно-кассовой техники в 2019 году?</h3>
                                <p>
                                    Налоговая уже выписала первые штрафы за нарушение требований 54-ФЗ. За неиспользование новой ККТ предпринимателя могут оштрафовать на 25–50% от суммы, проведенной мимо кассы, но не меньше 10 000 рублей. Организации — на 75–100%, но не менее 30 000 рублей. За использование ККТ, которая не соответствует требованиям закона, ИП грозит штраф до 3 000 рублей, а компании — до 10 000 рублей. При повторном нарушении, если сумма расчетов составит более 1 млн рублей, деятельность предпринимателя или организации может быть приостановлена на срок до 90 суток.
                                </p>
                                <p>
                                    С 1 июля 2018 года штрафов за неправильное применение касс стало больше. В Кодекс об административных нарушениях внесли поправки — теперь наказывать будут и за фиктивные чеки ККТ. С компаний смогут взыскать до 40 000 рублей, с ИП — до 10 000 руб. ФНС также сможет штрафовать за неправильно указанный маркируемый товар в чеке или несвоевременную передачу фискальных данных: организации на сумму до 100 000 рублей, предпринимателей — до 50 000 рублей. Если же ИП или компания попадутся на нарушении повторно, а сумма расчетов будет более 1 млн рублей, размер штрафа составит от 800 000 до 1 млн рублей.
                                </p>
                                <p>
                                    Кроме того, у налоговиков появится право блокировать работу касс, которые использовали при нарушении. Это будет возможно в присутствии двух понятых или с применением видеозаписи.
                                </p>
                                <h3>Что делать? </h3>
                                <p>
                                    Для отдельных льготников переход на новый порядок работы закончится 1 июля 2019 года, но для большинства предпринимателей он уже наступил 1 июля 2018. Поэтому покупать технику нужно уже сейчас. Откладывать уже некуда: учитывайте, что процесс может затянуться — нужной кассы может не оказаться в наличии, придется ждать поставку, регистрация кассы тоже займет какое-то время. А потом понадобится еще и настроить ККТ, выбрать и установить кассовую программу, проверить все это на совместимость и научиться работать.
                                </p>
                                <p>
                                    Переход пройдет намного проще и быстрее с готовым решением. Мы предлагаем онлайн-кассу под ключ: в одном комплекте — ККТ с фискальным накопителем, подписка на ОФД и удобная кассовая программа. Ждать поставки не придется — вся техника в наличии. Мы поможем все настроить и научим вас работать с программой. Решение проверенное и надежное: в прошлом году его уже испытали наши пользователи, которые попали в первую волну внедрения онлайн-касс.
                                </p>
                                <p>
                                </p>
                                <p>
                                </p>
                                <p>
                                    Эксперты прогнозируют дефицит фискальных накопителей на рынке, что приведет к завышению цен на них. По оценке Торгово-промышленной палаты РФ, сегодня ФН производится гораздо меньше, чем кассовых аппаратов, а задержки в поставках достигают трех месяцев.
                                </p>
                                <p>
                                    Поэтому начните переход прямо сейчас — не откладывая на крайний срок. А сэкономить время, нервы и деньги поможет МойСклад. Стоимость нашего комплекта «Эконом» покрывается налоговым вычетом. А наша кассовая программа совместима с новыми моделями ККТ, не требует установки и дорогостоящего внедрения, подходит для автоматизации любого числа розничных точек.
                                </p>
                                <p>
                                    С нами надежно! МойСклад — официальный участник первого эксперимента с онлайн-кассами: пилотного проекта, который провели еще в 2015 году. Тогда на первые несколько тысяч касс впервые поставили модуль, передающий данные в ФНС. Проект признали успешным — и внедрили по всей России.
                                </p>
                                <h2>Онлайн-кассы и малый бизнес </h2>
                                <h3>Применение ККТ для ЕНВД в 2018-2019 году</h3>
                                <p>
                                    Спецрежимников тоже касаются изменения в 54-ФЗ: с июля 2018 года должны были перейти на онлайн-кассы фирмы и ИП на ЕНВД и патенте с наемными сотрудниками, которые занимаются розничной торговлей или оказывают услуги общепита. Остальные получили отсрочку до 1 июля 2019 года. Подробнее <a href="/onlayn-kassy-dlya-ip-na-envd-i-psn-otsrochka-do-2021-goda" target="_blank">о сроках перехода на онлайн-кассы &gt;&gt;</a>
                                </p>
                                <h3>Применение ККТ при УСН в 2018-2019 году</h3>
                                <p>
                                    Для ИП применение ККМ при УСН в 2018 году было необходимо, как и для юрлиц. Право на отсрочку до 1 июля 2019 года получили только те компании и предприниматели на упрощенке, которые оказывают услуги населению. Вместо использования ККТ они пока могут выдавать клиентам бланки строгой отчетности.
                                </p>
                                <h3>Применение ККТ при оказании услуг населению в 2019 году</h3>
                                <p>
                                    Нет, в 2019 это не обязательно — при условии, что ИП или компания выдает клиентам бланки строгой отчетности. <a href="/onlayn-kassy-dlya-ip-na-envd-i-psn-otsrochka-do-2021-goda" target="_blank">Подробнее &gt;&gt;</a>
                                </p>
                                <h3>Получат ли отсрочку на применение ККТ в 2019 году ИП на патенте?</h3>
                                <p>
                                    Действующая редакция закона о ККТ с 2018 года касается только части предпринимателей на патенте. Те из них, у кого есть сотрудники на трудовых договорах и которые торгуют в розницу или оказывают услуги общепита, обязаны были поставить ККТ к 1 июля 2018. Для остальных налогоплательщиков на ПСН переход уже отложен — до 2019. Подробнее об этом читайте в нашей статье <a href="/onlayn-kassy-dlya-ip-na-envd-i-psn-otsrochka-do-2021-goda" target="_blank">о сроках перехода на 54-ФЗ для малого бизнеса &gt;&gt;</a>
                                </p>
                                <p>
                                    Посмотрите также запись нашего семинара, на котором руководитель отдела продаж МоегоСклада Иван Кириллин рассказал про изменения в 54-ФЗ, как выбрать кассу, какой вариант подойдет интернет-магазину, как перейти на ФФД 1.05 и НДС 20%.
                                </p>
                            </div>



                            </div>
                        <div class="col-md-0"></div>
                    </div>
                </div>
                </transition>
            </div>

        </section>


        <section class="best-seller-section">
            <div class="container">
                <div class="row">
                    <div class="col-md-12">
                        <div class="titie-section wow fadeInDown animated ">
                            <h1>РЕКОМЕНДУЕМ</h1>
                        </div>
                    </div>
                </div>
                <div class="row">
                    <div v-for="product in productsRec" class="col-md-3 col-sm-6 col-xs-12 cat-3 featured-items isotope-item">
                        <div class="product-item">
                            <div class="img-product">
                                <img :src="product.img" class="img-responsive" width="255" height="322" alt="">
                            </div>
                            <div class="product-hover">
                                <div class="product-meta">
                                    <a class="add_cart" @click="addCart(product.id)"><i class="pe-7s-cart"></i>Добавить в корзину</a>
                                </div>
                            </div>
                            <div class="product-title">
                                <a href="#">
                                    <h3>{{product.name}}</h3>
                                    <span>{{product.price}} ₽</span>
                                </a>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </section>

        <section class="contact-section">
            <div class="container">
                <div class="row">
                    <div class="col-sm-12">
                        <div class="titie-section wow fadeInDown animated ">
                            <h1>СВЯЗАТЬСЯ</h1>
                        </div>
                    </div>
                </div>
                <div class="row">
                    <div class="col-md-6 wow fadeInLeft animated">
                        <div class="left-content">
                            <h1><b>К</b>омпаниия <b>Т</b>ерминал</h1>
                            <p>Lorem ipsum dolor sit amet, consectetur adipiscing elit. Morbi vel nulla sapien. Class aptent tacitiaptent taciti sociosqu ad lit himenaeos. Suspendisse massa urna, luctus ut vestibulum necs et, vulputate quis urna. Donec at commodo erat.</p>
                            <div class="contact-info">
                                <p>Адрес: </p>
                                <p>Телефон: 8 (800) 000-00-00</p>
                                <p>Почта: info@terminal.com</p>
                            </div>
                            <div class="social-media">
                                <ul>
                                    <li><a href="#"><i class="fa fa-instagram"></i></a></li>
                                </ul>
                            </div>
                        </div>
                    </div>
                    <div class="col-md-6 wow fadeInRight animated">
                        <form action="" method="" class="contact-form">
                            <div class="row">
                                <div class="col-md-6">
                                    <div class="input-group">
                                        <input type="text" class="form-control" id="name" placeholder="Имя">
                                    </div>
                                </div>
                                <div class="col-md-6">
                                    <div class="input-group">
                                        <input type="text" class="form-control" id="name" placeholder="Почта">
                                    </div>
                                </div>
                            </div>
                            <div class="row">
                                <div class="col-md-12">
                                    <div class="input-group">
                                        <input type="text" class="form-control" id="name" placeholder="Тема">
                                    </div>
                                </div>
                            </div>
                            <div class="row mt-2">
                                <div class="col-md-12">
                                    <div class="input-group">
                                        <div class="textarea-form-footer">
                                            <textarea name="" id="" class="form-control" cols="30" rows="5" placeholder="Сообщение..."></textarea>
                                        </div>
                                    </div>
                                </div>
                            </div>
                            <div class="row">
                                <div class="col-md-12">
                                    <div class="input-group">
                                        <input type="submit" class="contact-submit" value="Отправить" />
                                    </div>
                                </div>
                            </div>
                        </form>
                    </div>
                </div>
            </div>
        </section>


    </div>
</template>

<script>
    export default {
        data: function () {
            return{
                categories: {},
                products: {},
                showProductsUpdate: false,
                styleSpanCountProducts: {},
                count_all: true,
                cart: {},
                cartMessage: {},
                showCartMessage: false,
                productsRec: {},
                showDiv2: false
            }
        },
        mounted() {
            this.getCategories();
            this.getProducts();
            this.getCartInfo();
            this.getProductsRec();setTimeout(() => {
                this.showProductsUpdate = true;
                this.showDiv2 = true
            }, 900);


        },
        methods:{
            getCategories: function () {
                axios({
                    method: 'get',
                    url: '/get_categories',
                }).then((response) => {
                    this.categories = response.data;

                });
            },
            showCategory: function ($categoryId) {
                this.showProductsUpdate = false;
                this.count_all = false;
                this.styleSpanCountProducts = {
                    top: '-23px',
                    right: '-6px'
                };
                axios({
                    method: 'get',
                    url: '/products/'+$categoryId,
                }).then((response) => {
                    this.products = response.data.products;
                    this.categories = response.data.categories;

                });
                setTimeout(() => {
                    this.showProductsUpdate = true;
                }, 500)

            },
            getProducts: function () {
                this.count_all = true;
                axios({
                    method: 'get',
                    url: '/get_products',
                }).then((response) => {
                    this.products = response.data;

                });
            },

            showAllCategories: function () {
                this.showProductsUpdate = false;
                this.count_all = true;
                axios({
                    method: 'get',
                    url: '/get_products',
                }).then((response) => {
                    this.products = response.data;
                    var app = this;
                    for(var i = 0;i<response.data.length;i++){
                        app.categories.categories[i].show = false;

                    }
                });
                setTimeout(() => {
                    this.showProductsUpdate = true;
                }, 500)
            },
            addCart: function (id) {
                this.addCartAnimation();
                axios({
                    method: 'get',
                    url: '/cart_add/'+id,
                }).then((response) => {
                    this.cart = response.data;
                    this.addCartAnimation(response.data.message);
                });

            },
            addCartAnimation: function (message) {
                this.showCartMessage = false;
                this.cartMessage = message;
                setTimeout(() => {
                    this.showCartMessage = true;
                }, 300);
                setTimeout(() => {
                    this.showCartMessage = false;
                }, 3000)
            },
            getCartInfo: function(){
                axios({
                    method: 'get',
                    url: '/cart_info',
                }).then((response) => {
                    this.cart = response.data;
                });
            },
            getProductsRec: function () {
                axios({
                    method: 'get',
                    url: '/get_recomended',
                }).then((response) => {
                    this.productsRec = response.data;
                    console.log
                });
            }

        }

    }
</script>
