<template>
    <div>

        <header-component></header-component>

        <section class="search-section">
            <div class="container">
                <div class="row subscribe-from">
                    <div class="col-md-12">
                        <form class="form-inline col-md-12 wow fadeInDown animated">
                            <div class="form-group">
                                <input type="email" class="form-control subscribe" id="email" placeholder="Search...">
                                <button class="suscribe-btn" ><i class="pe-7s-search"></i></button>
                            </div>
                        </form><!-- end /. form -->
                    </div>
                </div><!-- end of/. row -->
            </div><!-- end of /.container -->
        </section><!-- end of /.news letter section -->


        <section class="featured-section" style="    background: whitesmoke;">

            <div class="container">
                <transition name="showDiv2" >
                <div class="infomation_about" v-if="showDiv2">
                <div class="row">
                    <div class="col-md-12" >
                        <div class="titie-section wow fadeInDown animated ">
                            <h1>ФЗ-54</h1>
                        </div>
                    </div>
                </div>
                <div class="row">
                    <div class="col-md-12">
                      <h1 class="h1-fz text-center">Переход на ФФД 1.05 и НДС 20%: АТОЛ, ШТРИХ-М, Viki Print</h1>

                    </div>
                </div>
                    <div class="row">
                        <div class="col-md-12">
                            <div id="bx_689919819_2430">
                                <p>
                                    С 1 января 2019 действуют два новых обязательных требования к онлайн-кассам. Во-первых, меняется формат фискальных данных (ФФД): набор правил, по которым кассы передают информацию в налоговую через оператора фискальных данных. Новая версия ФФД — 1.05. Если ваша касса была зарегистрирована с указанием предыдущей версии ФФД 1.0 — ее придется перерегистрировать.
                                </p>
                                <p>
                                    Во-вторых, меняется ставка НДС: с 1 января 2019 — 20%. И онлайн-кассы должны будут печатать чеки с указанием именно такой ставки.
                                </p>
                                <p>
                                </p>
                                <p>
                                </p>
                                <p>
                                    Новые требования — обязательные. ФНС намерена строго следить за их выполнением и назначать штрафы в случае нарушений. Отсрочка по штрафам для опоздавших допустима только на короткое время (согласно письму службы ЕД-4-20/24234@&nbsp;от 13 декабря, в первом квартале 2019 предпринимателей не будут наказывать за чек, пробитый с указанием ставки&nbsp;НДС 18%, при условии, что товар был продан со ставкой 20%).&nbsp;До конца года нужно успеть настроить онлайн-кассы так, чтобы они соответствовали новым требованиям. Что для этого нужно предпринять? Кто поможет, сколько это стоит и можно ли сделать все самостоятельно? Разберемся вместе.
                                </p>
                                <p>
                                    О том, как в ваших документах — накладных, счетах-фактурах, договорах — уже сейчас учесть повышение НДС с 1 января 2019 года &gt;&gt;.
                                </p>
                                <h2>Переход на ФФД 1.05</h2>
                                <p>
                                    Переход на ФФД 1.05 закреплен в приказе ФНС от 21.03.2017 №ММВ-7-20/229@ и приказе ФНС с изменениями от 09.04.2018 №ММВ-7-20/207@. В последнем есть важная поправка: переход на ФФД 1.05 разрешается осуществлять без замены фискального накопителя. Это важно, поскольку значительно облегчает переход и снижает затраты.
                                </p>
                                <div class="alert alert-warning">
                                    Различайте версию фискального накопителя (ФН) и версию ФФД. Фискальные накопители могут иметь одну из двух версий: 1.0 или 1.1, — и поддерживают разные форматы фискальных данных. Версия 1.0 поддерживает ФФД 1.0 и 1.05 — поэтому с фискальным накопителем 1.0 можно спокойно перейти на новый формат фискальных данных 1 января 2019 года. Версия 1.1 поддерживает ФФД 1.1 — переход на этот формат фискальных данных еще предстоит в будущем.
                                </div>
                                <p>
                                    Как узнать, какую версию ФФД поддерживает ваша касса?
                                </p>
                                <p>
                                    Проще всего узнать это из чека информации о ККТ. Чтобы его напечатать, включите кассу с нажатой кнопкой промотки чековой ленты. Когда устройство издаст однократный звуковой сигнал — отпустите кнопку. Касса напечатает чек, в котором будет указана версия ФФД.
                                </p>
                                <p>
                                </p>

                                <p>
                                </p>
                                <p>
                                    Если в чеке указан ФФД 1.05 — вам ничего не нужно делать. Если 1.0 — вам предстоит переход.
                                </p>
                                <h2>Чеки при зачете предоплаты</h2>
                                <p>
                                    С 1 июля 2019 года предприниматели обязаны пробивать чеки по предоплате. Полная и частичная предоплаты — это варианты расчета, поддерживаемые в ФФД 1.05 и требующие дополнительного учета на фискальных документах. Это значит, что для правильно оформить предоплату без перехода на ФФД 1.05 будет невозможно.
                                </p>
                                <div class="alert alert-warning">
                                    В чем отличие предоплаты от аванса? В случае предоплаты всегда точно определен список покупаемых позиций, по которым впоследствии будет осуществлен расчет. А аванс — это ситуация, когда предприниматель просто получил на счет определенную сумму.
                                </div>

                                <h2>Переход на НДС 20%</h2>
                                <p>
                                    Переход на новую ставку НДС закреплен в федеральном законе 303-ФЗ от 3 августа 2018 года. Если вы применяете ставку 18% — с 1 января 2019 года вы должны применять 20%. Если (для предоплаты) 18/118% — меняете на 20/120%.
                                </p>
                                <p>
                                    Кого это касается?
                                </p>
                                <p>
                                    Всех плательщиков НДС. Если вы не платите НДС — ничего менять не нужно. Если платите — к 1 января 2019 года вам нужно привести кассу в соответствие требованию о новой ставке.
                                </p>
                                <div class="alert alert-warning">
                                    ФНС пока не дала окончательных разъяснений о том, как именно будет происходить переход на новую ставку НДС в 2019 году. Пока, по предварительным данным, ожидаемая схема работы такая:<br>
                                    <br>
                                    — Если вы продаете товары или оказываете услуги с 1 января 2019 года, включая договоры, заключенные до 1.01.19, предоплаченные или частично предоплаченные до 1.01.19) — вам нужно использовать ставку НДС 20%.<br>
                                    <br>
                                    — Если вы в 2018 году собираетесь взять оплату или частичную оплату за товары или услуги, которые отгрузите в 2019 году, — используйте ставку 18/118%. При этом в 2019 году у вас возникнет сложность, поскольку окончательный расчет при поставке или реализации нужно будет сделать по ставке 20%. При авансе или предоплате в 2018 с поставкой в 2019 возникнет разница в ставке НДС, которую потребуется вашему клиенту или вам (то есть оформить в виде скидки).<br>
                                    <br>
                                    — Возврат товаров, которые были проданы в 2018 году, но возвращены будут в 2019, надо будет делать по ставке НДС 18%.
                                </div>
                                <p>
                                    <strong>Важно!</strong> Перейти на новую ставку НДС необходимо строго к 1 января. Норма закона 54-ФЗ П.8 ст.1.2, которая разрешает в случае появления дополнительных требований к ККТ привести технику в соответствие новому закону в течение года, в данном случае НЕ действует. Никаких юридических лазеек нет. Уже 1 января 2019 года ставка НДС в любом чеке должна быть именно 20%. ФНС намерена отслеживать исполнение и штрафовать за нарушения. Таким образом, лучше обновить кассы заранее, чтобы с 1 января в чеке гарантированно печаталась правильная ставка НДС.
                                </p>
                                <div class="alert alert-warning">
                                    Хорошие новости для пользователей МоегоСклада. Мы автоматически обновим драйвер ККТ и версию Кассы МойСклад под новую ставку НДС. Для этого в настройках компании (<strong>Меню пользователя</strong> — <strong>Настройки</strong> — <strong>Справочники</strong> — <strong>Юр. лица</strong>) должно быть отмечено, что вы платите НДС.
                                </div>
                                <p>
                                    Итак, вот короткий чек-лист подготовки вашей кассы к Новому году:
                                </p>
                                <ol>
                                    <li>Проверьте версию ФФД на кассе. Если 1.0 — требуется апгрейд. Если 1.05 — ничего менять не нужно!</li>
                                    <li>Проверьте, платите ли вы НДС. Если да — приготовьтесь менять прошивку кассы. Если нет — ничего делать не нужно.</li>
                                </ol>
                                <h2>Обновление Viki Print (Дримкас): НДС 20% и ФФД 1.05</h2>
                                <p>
                                    Все кассы Viki Print поддерживают НДС 20% и ФФД 1.05. Но самостоятельно проапгрейдить их не получится: обновить прошивку устройства смогут только специалисты. Для этого вам обязательно нужно обратиться в сервисный центр Дримкас, который обслуживает вашу технику. Лучше сделать это как можно скорее. Обновление уже доступно, и если вы еще не обратились в сервисный центр&nbsp;— не теряйте времени, чтобы потом не ждать в очереди.
                                </p>
                                <p>
                                    Обратите внимание, что такое обновление не является гарантийным обязательством — то есть будет платным. Стоимость зависит от выбранного сервисного центра: каждый из них сам устанавливает цены на услуги. Если вы считаете, что цена слишком высокая, то можете попробовать другой авторизованный сервисный центр Дримкас.
                                </p>

                                <h2>Обновление ШТРИХ-М: ФФД 1.05</h2>
                                <p>
                                    Под ФФД 1.05 кассы ШТРИХ-М можно обновить самостоятельно и бесплатно. Для этого:
                                </p>
                                <ul type="square">
                                    <li>Найдите на сайте ШТРИХ-М в разделе Продукты свою модель кассы, откройте вкладку Скачать и загрузите программу «Драйвер ФР ШТРИХ-М». Или скачайте ее из личного кабинета ЦТО. Актуальная версия драйвера — 4.14.0.701.</li>
                                    <li>Выполните переход с ФФД 1.0 на ФФД 1.05 по инструкции &gt;&gt;  </li>
                                    <li>Выполните отчет о перерегистрации. Это можно сделать через драйвер ККТ или через упрощенную утилиту «Программа мастер фискализации/модернизации (v.1.1.27)». Ее можно скачать из личного кабинета ЦТО в разделе «Дополнительные материалы» для своей модели ФР. </li>
                                </ul>
                                <p>
                                    Переход на ФФД 1.05 ШТРИХ-М рекомендует сделать уже сейчас: все ОФД уже принимают документы по новому стандарту. Проапгрейдите кассу как можно скорее: важно успеть все сделать вовремя, не позднее 31 декабря 2018 года.
                                </p>
                                <p>
                                    Если вы не хотите заниматься обновлением сами — обратитесь к партнерам: выберите подходящего из списка и договоритесь в рамках обслуживания.
                                </p>
                                <h2>Обновление ШТРИХ-М: НДС 20%</h2>
                                <p>
                                    Обновить прошивку касс ШТРИХ-М под НДС 20% самостоятельно невозможно. Для этого необходимо обратиться в сервисный центр производителя, где вам понадобится купить лицензию на каждую кассу. При этом вы получите файл лицензии. Затем обновите прошивку и драйвер ККТ до последней версии, как описано в пункте выше. После этого вы сможете работать в нем с лицензиями. Добавьте файл купленной лицензии. После этого касса будет готова к работе с НДС 20%.
                                </p>
                                <p>
                                    Если ваш сервисный центр ШТРИХ-М занимается поддержкой и настройкой ККТ, лучше обратитесь к специалисту для выполнения этих операций.
                                </p>
                                <h2>Обновление ККТ АТОЛ: ФФД 1.05</h2>
                                <p>
                                    Кассы АТОЛ можно проапгрейдить самостоятельно или с помощью партнеров.
                                </p>
                                <p>
                                    Чтобы узнать, можете ли вы сделать все сами, проверьте версию прошивки ККТ. Если она меньше, чем 4555, ее нужно обновить с помощью партнеров АТОЛ. Если 4555 и выше, то можно переходить на ФФД 1.05 без изменения прошивки.
                                </p>
                                <p>
                                    Чтобы перейти на ФФД 1.05:
                                </p>
                                <ul>
                                    <li>Закройте смену.</li>
                                    <li>Убедитесь, что все ранее сформированные фискальные документы переданы в ОФД.</li>
                                    <li>Скачайте, установите и запустите приложение Утилита регистрации ККТ АТОЛ. Выполните в нем перерегистрацию кассы. При этом укажите причину перерегистрации — изменение параметров ККТ. На следующем экране поменяйте версию ФФД: укажите 1.05.</li>
                                    <li>Подайте заявление о перерегистрации ККТ в ФНС. Это можно сделать на сайте ФНС. </li>
                                </ul>
                                <h2>Прошивка АТОЛ под НДС 20%</h2>
                                <p>
                                    АТОЛ выпустила новую прошивку: внутреннее ПО кассы, которое автоматически изменит НДС с 18 на 20% в 00 часов 00 минут 1 января 2019 года. Для этого нужно:&nbsp;
                                </p>
                                <p>
                                    — установить саму новую прошивку — она вышла в октябре 2018,&nbsp;
                                </p>
                                <p>
                                    — закрыть смену до 24 часов 31 декабря 2018.
                                </p>
                                <p>
                                    Также пользователям АТОЛ понадобится обновить драйвер ККТ и обновить версию кассовой программы — в случае, если ставку НДС считает не касса. Владельцам ньюджеров АТОЛ и экономных касс АТОЛ 90Ф понадобится только обновить прошивку.
                                </p>
                                <div class="alert alert-warning">
                                    Хорошие новости для пользователей связки АТОЛ + МойСклад: драйвер ККТ и кассовую программу МойСклад обновит автоматически, от вас потребуется только обновить прошивку в кассе.
                                </div>
                                <p>
                                    Как обновить прошивку ККТ АТОЛ под НДС 20%?
                                </p>
                                <p>
                                    Займитесь обновлением уже сейчас, если вы этого еще не сделали! Обновить прошивку касс АТОЛ можно:
                                </p>
                                <ul>
                                    <li>В офисе сервисного партнера АТОЛ: для этого вам понадобится привезти туда кассу. </li>
                                    <li>В месте установки кассовой техники: для этого вызовите к себе инженера, чтобы он настроил вашу кассу.</li>
                                    <li>Дистанционно — с помощью облачных инструментов АТОЛ Сервис. Компания АТОЛ готовит надежный, понятный и быстрый способ обновить прошивку самостоятельно и удаленно.</li>
                                </ul>
                                <p>

                                </p>
                                <span class="likeh3">Итог</span>
                                <p>
                                    Не все производители касс предоставляют пользователям возможность самостоятельно обновить прошивку. Но и не все пользователи достаточно технически подкованы для этого. Если у вас одна касса, и вам предстоит разовая процедура, — лучше обратитесь к специалистам. Не стоит пытаться сэкономить деньги: если что-то пойдет не так, стоимость потерь превысит выгоду. Погружаться в технические нюансы самостоятельно имеет смысл, только если у вас несколько касс и есть собственные технические специалисты для подстраховки.
                                </p>
                                <span class="likeh2">ВОПРОСЫ И ОТВЕТЫ</span>
                                <h3>Как узнать, какой у моей кассы ФФД?</h3>
                                <p>
                                    Напечатайте чек информации: включите кассу с нажатой кнопкой промотки чековой ленты, после однократного звукового сигнала отпустите кнопку. Касса напечатает чек, в котором будет указана версия ФФД.
                                </p>
                                <h3>Нужно ли менять ФН при смене ФФД 1.0 на 1.05?</h3>
                                <p>
                                    Нет, не нужно. Это официальная информация от ФНС. Фискальный накопитель нужно менять только по истечении его срока действия.
                                </p>
                                <h3>Что делать, если у меня ФН на 36 месяцев, и его срок не истек?</h3>
                                <p>
                                    Продолжайте работать с этим фискальным накопителем. Менять ФН при переходе с ФФД 1.00 на 1.05 не нужно.
                                </p>
                                <h3>Если у меня версия ФН — 1.0, а ФФД ККТ — 1.05, нужно ли менять? </h3>
                                <p>
                                    Нет, не нужно.
                                </p>
                                <h3>Как можно без партнеров обновить прошивку ККТ АТОЛ?</h3>
                                <p>
                                    Дистанционно — через облачные инструменты АТОЛ Сервис.
                                </p>
                                <h3>Как быть с арендуемыми кассами АТОЛ? Когда можно обновить прошивку и куда обратиться?</h3>
                                <p>
                                    Для онлайн-касс также потребуется обновление прошивки. Нужно связаться с АТОЛ Онлайн, там помогут спланировать обновление.
                                </p>
                                <h3>Зачем в чеке печатать НДС, если мы работаем без него?</h3>
                                <p>
                                    «БЕЗ НДС» — это тоже тип налоговой ставки.
                                </p>
                                <h3>Почему на чеках пишется строка про НДС под каждым товаром, если я не использую НДС? Можно ее убрать?</h3>
                                <p>
                                    Пока это убрать нельзя.
                                </p>
                                <h3>До какого времени нужно будет перейти с ФФД 1.05 на ФФД 1.1?</h3>
                                <p>
                                    Срок пока не определен, прогноз — 2021 год.
                                </p>
                                <h3>После смены ФФД или ставки НДС нужно ли перерегистрировать кассу в ФНС?</h3>
                                <p>
                                    Нужно — после смены ФФД.
                                </p>
                                <h3>Как сегодня правильно оформлять предоплату? </h3>
                                <p>
                                    До перехода на ФФД 1.05 нет строгих рекомендаций. Мы рекомендуем пробивать чек на товар «Предоплата», а потом при передаче товаров делать 100% скидку на чек с товарами.
                                </p>
                                <h3>Как проверить версию прошивки на Ритейл-01Ф (Штрих-М)?</h3>
                                <p>
                                    На ПК нужно установить программу «Драйвер ФР ШТРИХ-М», которую можно бесплатно скачать с сайта. Актуальная версия драйвера 4.14.0.701.
                                </p>
                                <h3>Кассу регистрировали с ФФД 1.05, при распечатке тест-листа версия ФФД ФН — 1.0. В какой версии работает ФН?</h3>
                                <p>
                                    Не надо смешивать версию ФН и версию ФФД ККТ.
                                </p>
                                <p>
                                    Есть два вида ФН: ФН 1.0 и ФН 1.1. И есть три версии ФФД: 1.0, 1.05, 1.1.
                                </p>
                                <p>
                                    В случае работы с ФН 1.0 под ФФД 1.05 сам ФН никак не видит ФФД 1.05 и не участвует в тех изменениях, которые прошли в ФФД. Поэтому на ФН 1.0 версия ФФД 1.05 никак не повлияет и будет отображаться версия ФН 1.0.
                                </p>
                                <h3>Для ставки 20% в АТОЛ кассах будет отдельный код (1 - 0%, ... 7 - 20%)?</h3>
                                <p>
                                    Нет. Тот тег, что был использован для ставки НДС 18%, будет заменен на 20%.
                                </p>
                                <h3>Партнеры обновляют кассы бесплатно?</h3>
                                <p>
                                    Нет, партнеры оказывают услуги за деньги.
                                </p>
                                <h3>Можно ли будет печатать на кассах АТОЛ код товара с 01.01.2019?</h3>
                                <p>
                                    Код товара содержится в теге 1162, данный тег реализован в кассах. Значение данного тега нужно заполнять только для маркированных товаров, которые уже будут обязательны к маркировке.
                                </p>
                                <h3>Когда в чеке изменится «электронные» на «безналичный расчет»?</h3>
                                <p>
                                    Позже. Об этом сообщат дополнительно. Но это будет только изменение в наименовании на чеке. Сделать его можно только после того, как будут приняты изменения к приказу ФНС о Форматах фискальных документов. К настоящему моменту этот документ не принят, поэтому у производителей касс нет оснований делать переименование реквизита.
                                </p>
                                <h3>Для каких случаев автоматически поменяется ставка, если ставка у товара явно не указана?</h3>
                                <p>
                                    Для тех, у которых в карточке товара указана была ставка НДС 18%.
                                </p>
                                <p>
                                    Смотрите также запись вебинара, который мы провели совместно коллегами из компании АТОЛ. Мы рассказали о грядущих изменениях и разобрали, как и что надо перенастроить.
                                </p>



                            </div>



                        </div>
                        <div class="col-md-0"></div>
                    </div>
                </div>
                </transition>
            </div>

        </section>


        <section class="best-seller-section">
            <div class="container">
                <div class="row">
                    <div class="col-md-12">
                        <div class="titie-section wow fadeInDown animated ">
                            <h1>РЕКОМЕНДУЕМ</h1>
                        </div>
                    </div>
                </div>
                <div class="row">
                    <div v-for="product in productsRec" class="col-md-3 col-sm-6 col-xs-12 cat-3 featured-items isotope-item">
                        <div class="product-item">
                            <div class="img-product">
                                <img :src="product.img" class="img-responsive" width="255" height="322" alt="">
                            </div>
                            <div class="product-hover">
                                <div class="product-meta">
                                    <a class="add_cart" @click="addCart(product.id)"><i class="pe-7s-cart"></i>Добавить в корзину</a>
                                </div>
                            </div>
                            <div class="product-title">
                                <a href="#">
                                    <h3>{{product.name}}</h3>
                                    <span>{{product.price}} ₽</span>
                                </a>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </section>

        <section class="contact-section">
            <div class="container">
                <div class="row">
                    <div class="col-sm-12">
                        <div class="titie-section wow fadeInDown animated ">
                            <h1>СВЯЗАТЬСЯ</h1>
                        </div>
                    </div>
                </div>
                <div class="row">
                    <div class="col-md-6 wow fadeInLeft animated">
                        <div class="left-content">
                            <h1><b>К</b>омпаниия <b>Т</b>ерминал</h1>
                            <p>Lorem ipsum dolor sit amet, consectetur adipiscing elit. Morbi vel nulla sapien. Class aptent tacitiaptent taciti sociosqu ad lit himenaeos. Suspendisse massa urna, luctus ut vestibulum necs et, vulputate quis urna. Donec at commodo erat.</p>
                            <div class="contact-info">
                                <p>Адрес: </p>
                                <p>Телефон: 8 (800) 000-00-00</p>
                                <p>Почта: info@terminal.com</p>
                            </div>
                            <div class="social-media">
                                <ul>
                                    <li><a href="#"><i class="fa fa-instagram"></i></a></li>
                                </ul>
                            </div>
                        </div>
                    </div>
                    <div class="col-md-6 wow fadeInRight animated">
                        <form action="" method="" class="contact-form">
                            <div class="row">
                                <div class="col-md-6">
                                    <div class="input-group">
                                        <input type="text" class="form-control" id="name" placeholder="Имя">
                                    </div>
                                </div>
                                <div class="col-md-6">
                                    <div class="input-group">
                                        <input type="text" class="form-control" id="name" placeholder="Почта">
                                    </div>
                                </div>
                            </div>
                            <div class="row">
                                <div class="col-md-12">
                                    <div class="input-group">
                                        <input type="text" class="form-control" id="name" placeholder="Тема">
                                    </div>
                                </div>
                            </div>
                            <div class="row mt-2">
                                <div class="col-md-12">
                                    <div class="input-group">
                                        <div class="textarea-form-footer">
                                            <textarea name="" id="" class="form-control" cols="30" rows="5" placeholder="Сообщение..."></textarea>
                                        </div>
                                    </div>
                                </div>
                            </div>
                            <div class="row">
                                <div class="col-md-12">
                                    <div class="input-group">
                                        <input type="submit" class="contact-submit" value="Отправить" />
                                    </div>
                                </div>
                            </div>
                        </form>
                    </div>
                </div>
            </div>
        </section>


    </div>
</template>

<script>
    export default {
        data: function () {
            return{
                categories: {},
                products: {},
                showProductsUpdate: false,
                styleSpanCountProducts: {},
                count_all: true,
                cart: {},
                cartMessage: {},
                showCartMessage: false,
                productsRec: {},
                showDiv2: false
            }
        },
        mounted() {
            this.getCategories();
            this.getProducts();
            this.getCartInfo();
            this.getProductsRec();setTimeout(() => {
                this.showProductsUpdate = true;
                this.showDiv2 = true
            }, 900);


        },
        methods:{
            getCategories: function () {
                axios({
                    method: 'get',
                    url: '/get_categories',
                }).then((response) => {
                    this.categories = response.data;

                });
            },
            showCategory: function ($categoryId) {
                this.showProductsUpdate = false;
                this.count_all = false;
                this.styleSpanCountProducts = {
                    top: '-23px',
                    right: '-6px'
                };
                axios({
                    method: 'get',
                    url: '/products/'+$categoryId,
                }).then((response) => {
                    this.products = response.data.products;
                    this.categories = response.data.categories;

                });
                setTimeout(() => {
                    this.showProductsUpdate = true;
                }, 500)

            },
            getProducts: function () {
                this.count_all = true;
                axios({
                    method: 'get',
                    url: '/get_products',
                }).then((response) => {
                    this.products = response.data;

                });
            },

            showAllCategories: function () {
                this.showProductsUpdate = false;
                this.count_all = true;
                axios({
                    method: 'get',
                    url: '/get_products',
                }).then((response) => {
                    this.products = response.data;
                    var app = this;
                    for(var i = 0;i<response.data.length;i++){
                        app.categories.categories[i].show = false;

                    }
                });
                setTimeout(() => {
                    this.showProductsUpdate = true;
                }, 500)
            },
            addCart: function (id) {
                this.addCartAnimation();
                axios({
                    method: 'get',
                    url: '/cart_add/'+id,
                }).then((response) => {
                    this.cart = response.data;
                    this.addCartAnimation(response.data.message);
                });

            },
            addCartAnimation: function (message) {
                this.showCartMessage = false;
                this.cartMessage = message;
                setTimeout(() => {
                    this.showCartMessage = true;
                }, 300);
                setTimeout(() => {
                    this.showCartMessage = false;
                }, 3000)
            },
            getCartInfo: function(){
                axios({
                    method: 'get',
                    url: '/cart_info',
                }).then((response) => {
                    this.cart = response.data;
                });
            },
            getProductsRec: function () {
                axios({
                    method: 'get',
                    url: '/get_recomended',
                }).then((response) => {
                    this.productsRec = response.data;
                    console.log
                });
            }

        }

    }
</script>
